(ns clojucture.local_cn_test
  (:require [clojure.test :refer :all]
            [clojucture.local_cn :as cn]
            ))


(def jy-info {
  :meta [:update-date "2018-11-1"]
  :账户 [
    {:名称 :收入分账户 :余额 0}
    {:名称 :本金分账户  :余额 0}
    {:名称  :分配本金账户  :余额 0}
    {:名称  :分配利息账户  :余额 0}
    {:名称  :分配费用账户  :余额 0}
    {:名称  :服务转移和通知储备账户  :余额 0}
    {:名称 :税收储备账户 :余额 0}
   ]

  :日期 {:初始起算日 "2017-11-14"
        :支付日 "2018-02-26M"
        :计息日   "2018-01-23,2018-02-26M"
        :计算日   "2019-01-31ME"
        :信托分配日 "2018-02-26M-6WD"
        :法定到期日 "2049-01-01" }

  :资产池 {
    :封包日 "2017-11-20"
    :类型 :住房按揭
    :资产清单
    [
     {:初始面额 1250000000 :当前面额 1010000000 :年利率 0.049 :摊销 "等额本息" :初始日 "2013-12-25"
      :支付日期 "2014-01-25M" :初始期限 240 :当前期限 200 }
     {:初始面额 1250000000 :当前面额 1010000000 :年利率 0.049 :摊销 "等额本息" :初始日 "2013-12-25"
      :支付日期 "2014-01-25M" :初始期限 240 :当前期限 200  }

    ]
  }



  :债券    [
            {:简称 "A-1" :初始面额 2550000000 :当前余额 2550000000 :预期到期日 "2019-2-26" :法定到期日 "2047-4-26" }
            {:简称 "A-2" :初始面额 6150000000 :当前余额 6150000000 :预期到期日 "2023-3-26" :法定到期日 "2047-4-26"}
            {:简称 "次级" :初始面额 1299999999.72 :当前余额 1299999999.72 :预期到期日 "2047-4-26":法定到期日 "2047-4-26"}
          ]
  :风险事件 {
            :违约事件 {}
             :加速清偿事件 {}
             }
  :费用  {}

  })

(deftest tAcc
  (let [ accounts  (cn/setup-accounts jy-info)]
    (is (= (:name (first accounts) ) :收入分账户))
    (is (= (:balance (first accounts) ) 0 ))
    )
  )


(comment
(deftest tBuildBankDeal
  (let [ jy-bank  (cn/build-deal jy-info )]



    )
  )

)